[
  {
    "id": "AB1633",
    "memTitle": "Curtail spurious pocket housing vetoes and CEQA abuse.",
    "formalTitle": "An act to amend Section 65589.5 of the Government Code, relating to housing.",
    "summary": "Amends the Housing Accountability Act to expand the definition of 'disapproving' a housing development project to include instances where a local agency fails to make a timely determination on a project's CEQA exemption or commits an abuse of discretion. It also expands the definition to include failing to adopt or certify a negative declaration, addendum, EIR, or comparable environmental document for a project that meets specified location and density criteria. The bill aims to facilitate housing development by limiting the ability of local agencies to disapprove or condition housing projects in violation of the Housing Accountability Act.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB1633",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-11",
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "whack-a-mole"
    ]
  },
  {
    "id": "SB312",
    "memTitle": "Universities building housing can have a smidge more leeway on LEED standards",
    "formalTitle": "An act to amend Section 21080.58 of the Public Resources Code, relating to environmental quality.",
    "summary": "Amends the California Environmental Quality Act (CEQA) exemption for university housing development projects. Changes the requirement for each building in an exempt project to qualify for LEED Platinum certification to LEED Gold certification with a point total of 79 or better. A public university must obtain LEED Platinum certification for each building within 12 months of occupancy. The university cannot exempt a new project until obtaining LEED Platinum for all buildings in the prior exempted project. Aims to facilitate more university housing development by easing the LEED certification requirements for CEQA exemption.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB312",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "relatedBills": [
      "SB886"
    ],
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "universities",
      "environmental quality act"
    ]
  },
  {
    "id": "SB937",
    "memTitle": "Permission to build must last longer, even pending lawsuits, and fees must wait.",
    "formalTitle": "An act to amend Sections 66000, 66007, and 66013 of, and to add Section 65914.6 to, the Government Code, relating to land use.",
    "summary": "Extends by 24 months the period for the expiration, effectuation, or utilization of a housing entitlement issued before January 1, 2024, that will expire before December 31, 2025, except as specified. The bill tolls this 24-month extension during any legal challenge of the housing entitlement. It also addresses fees for development projects, specifying that water and sanitation districts are included in the definition of a local agency for purposes of the Mitigation Fee Act, and prohibits local agencies from requiring the payment of certain fees or charges until the certificate of occupancy is issued, among other provisions.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB937",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "permitting",
      "fees",
      "fee transparency"
    ]
  },
  {
    "id": "SB951",
    "memTitle": "Coastal Commission: stop some of your NIMBY nonsense and butt out of already-urban SF.",
    "formalTitle": "An act to amend Section 65583 of the Government Code, and to amend Section 30603 of, and to add Section 30175 to, the Public Resources Code, relating to coastal resources.",
    "summary": "Streamlines housing development in coastal areas by amending the California Coastal Act of 1976. Introduces changes aimed at easing housing element requirements and rezoning standards for jurisdictions within the coastal zone, including the City and County of San Francisco. Modifies appeal processes for coastal development permits and allows for electronic notification to the California Coastal Commission.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB951",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "coastal"
    ]
  },
  {
    "id": "SB1227",
    "memTitle": "SF, no more CEQA for your NIMBYs to weaponize, and some home-building incentives.",
    "formalTitle": "An act to add and repeal Section 21080.59 of the Public Resources Code, and to amend Section 214 of the Revenue and Taxation Code, relating to housing.",
    "summary": "Introduces tax incentives and CEQA exemptions for development projects within a defined downtown revitalization zone in San Francisco until 2035, aimed at stimulating urban development. It mandates the use of a skilled workforce for these projects, under penalty of perjury, and proposes a partial property tax exemption for properties serving moderate-income households, subject to specific conditions. The bill is a targeted effort to boost housing and commercial development in San Francisco's downtown area, with specific benefits for moderate-income housing projects, and requires developers to adhere to labor standards.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1227",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "environmental quality act",
      "affordable housing",
      "tax exemption"
    ]
  },
  {
    "id": "SB4",
    "memTitle": "Universities and religious institutions, let's build some housing!",
    "formalTitle": "Planning and zoning: housing development: higher education institutions and religious institutions.",
    "summary": "Requires housing development projects to be a use by right upon request from qualified developers on land owned by higher education institutions or religious institutions, if specified criteria are met. 100% of units must be affordable, with 20% allowed for moderate-income and 5% for institution staff. Provides density bonuses and CEQA exemptions for qualifying projects, while requiring skilled and trained workforce and healthcare expenditure standards for projects with 50+ units.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB4",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-11",
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "universities",
      "yigby",
      "affordable housing"
    ]
  },
  {
    "id": "HB24-1007",
    "memTitle": "Nix arbitrary occupancy limits, let roommates be roommates.",
    "formalTitle": "An act concerning residential occupancy limits.",
    "summary": "The bill, titled the 'HOME (Harmonizing Occupancy Measures Equitably) Act,' prohibits local governments from enacting or enforcing residential occupancy limits based on familial relationships. Local governments retain the authority to implement occupancy limits based only on demonstrated health and safety standards, such as building codes, fire codes, or wastewater and water quality standards, or on affordable housing program guidelines. The bill aims to increase housing availability by limiting the ability of local governments to impose arbitrary occupancy restrictions.",
    "legislativeTextURI": "http://leg.colorado.gov/bills/hb24-1007",
    "states": [
      "Colorado"
    ],
    "statuses": [
      "Passed"
    ],
    "inEffectDate": "2024-04-15",
    "sponsors": [
      "Manny Rutinel",
      "Javier Mabrey",
      "Tony Exum",
      "Julie Gonzales"
    ],
    "tags": [
      "occupancy limits"
    ]
  },
  {
    "id": "HB24-1304",
    "memTitle": "Cut the parking minimums and let the market decide.",
    "formalTitle": "An act concerning parking requirements within metropolitan planning organizations.",
    "summary": "The bill prohibits counties and municipalities within metropolitan planning organizations from enforcing minimum parking requirements for real property on or after January 1, 2025. It allows local governments to impose requirements on voluntarily provided parking spaces, such as charging for use and allowing vehicle charging stations. The bill requires local governments to submit compliance reports to the Department of Local Affairs and mandates a study on parking usage and needs in metropolitan planning organizations.",
    "legislativeTextURI": "http://leg.colorado.gov/bills/hb24-1304",
    "states": [
      "Colorado"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Stephanie Vigil",
      "Steven Woodrow",
      "Kevin Priola",
      "Nick Hinrichsen"
    ],
    "tags": [
      "parking mandates"
    ]
  },
  {
    "id": "HB24-1152",
    "memTitle": "Let some ADUs get built",
    "formalTitle": "An act concerning increasing the number of accessory dwelling units.",
    "summary": "The bill requires subject jurisdictions (municipalities with 1,000+ population and counties with census-designated places of 10,000+ within metropolitan planning organizations) to allow one ADU per single-family lot through an administrative approval process, prohibiting certain restrictions. It creates an incentive program certifying ADU-supportive jurisdictions, which can receive grants for promoting ADU construction. The bill also establishes an ADU loan program and prevents HOAs and planned unit developments from restricting ADUs more than local law.",
    "legislativeTextURI": "http://leg.colorado.gov/bills/hb24-1152",
    "states": [
      "Colorado"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Judy Amabile",
      "Ron Weinberg",
      "Kyle Mullica",
      "Tony Exum"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "HB24-1313",
    "memTitle": "Increase housing in transit-oriented communities",
    "formalTitle": "An act concerning measures to increase the affordability of housing in transit-oriented communities.",
    "summary": "Requires transit-oriented communities to meet housing opportunity goals by ensuring enough areas qualify as transit centers, and requiring that transit centers allow density of 15+ units/acre, and have an administrative approval process for 5 acre or smaller multifamily. Communities to submit reports on meeting goals and implementing affordability and displacement mitigation strategies. Funding and support provided through grants for upgrading infrastructure in transit centers. The bill also limits housing restrictions by planned unit developments and HOAs in transit centers.",
    "legislativeTextURI": "http://leg.colorado.gov/bills/hb24-1313",
    "states": [
      "Colorado"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Dylan Woodrow",
      "Iman Jodeh",
      "Chris Hansen",
      "Faith Winter"
    ],
    "tags": [
      "zoning reform",
      "transit oriented development"
    ]
  },
  {
    "id": "SB684",
    "memTitle": "At least allow *small* housing developments in urban areas!",
    "formalTitle": "An act to add Sections 65852.28, 65913.4.5, and 66499.41 to the Government Code, relating to land use.",
    "summary": "Requires local agencies to ministerially approve, without discretionary review, parcel maps, tentative maps, and final maps for housing development projects of 10 or fewer units on lots zoned for multifamily, 5 acres or less, substantially surrounded by urban uses. It streamlines building permits for such projects and limits the standards local agencies can impose. The bill exempts such projects from minimum parcel size requirements and HOA formation. It also prevents accessory dwelling units and SB 9 lot splits from being required on parcels created through this process.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240SB684",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2024-07-01",
    "sponsors": [
      "Anna Caballero"
    ],
    "tags": [
      "permitting",
      "small scale development"
    ]
  },
  {
    "id": "BR996",
    "memTitle": "Do a bunch of YIMBY zoning reforms all at once",
    "formalTitle": "AN ACT relating to housing opportunities.",
    "summary": "The HOME (Housing Opportunities Made Easier) Act aims to expand housing options in Kentucky. It prohibits minimum square footage requirements and most aesthetic design standards on housing unless necessary for health and safety. It allows duplexes in all single-family zones, triplexes and quadplexes in city single-family zones, and secondary dwelling units and tiny homes on single-family lots. It streamlines permitting and variance processes and limits fees. It allows home occupations and mixed-use in residential and commercial zones, with some restrictions. The bill also prevents most rental restrictions by local governments.",
    "legislativeTextURI": "https://apps.legislature.ky.gov/record/24rs/hb102.html",
    "states": [
      "Kentucky"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Steven Doan",
      "Josh Calloway",
      "Daniel Grossberg",
      "Nancy Tate"
    ],
    "major": true,
    "tags": [
      "zoning reform",
      "missing middle",
      "permitting",
      "mixed use",
      "rental restrictions"
    ]
  },
  {
    "id": "AB1893",
    "memTitle": "More Accountability for the Housing Accountability Act",
    "formalTitle": "An act to amend Section 65589.5 of the Government Code, relating to land use.",
    "summary": "Amends the Housing Accountability Act to further restrict a local agency's ability to deny or condition housing development projects. It revises the definition of housing for lower/moderate-income households to include projects dedicating at least 10% of units to lower-income households or projects of 10 units or fewer. For agencies without a substantially compliant housing element, it allows project denial only if it exceeds certain density thresholds, fails to meet certain location/site criteria, or fails to comply with objective development standards from the closest multifamily residential zone. It deems projects meeting specified density criteria compliant with ministerial streamlining laws.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240AB1893",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Buffy Wicks"
    ],
    "tags": [
      "whack-a-mole",
      "zoning reform"
    ]
  },
  {
    "id": "SB886",
    "memTitle": "Public university housing projects can have some relief from CEQA",
    "formalTitle": "An act to add and repeal Section 21080.58 of the Public Resources Code, relating to environmental quality.",
    "summary": "This bill, until January 1, 2030, exempts from CEQA university housing development projects carried out by a public university on university-owned property if certain requirements are met, including LEED platinum certification, fully mitigated construction impacts, location restrictions, no net additional greenhouse gas emissions, payment of prevailing wages, use of a skilled and trained workforce, and a public hearing. The bill prohibits a certificate of occupancy until LEED certification is achieved and construction impacts are mitigated. Projects involving demolition of affordable/rent-controlled units, historic structures, or recent tenant-occupied housing are not eligible.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220SB886",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-09-28",
    "sponsors": [
      "Scott Wiener"
    ],
    "relatedBills": [
      "SB312"
    ],
    "tags": [
      "universities",
      "environmental quality act"
    ]
  },
  {
    "id": "SB35",
    "memTitle": "Bypass supply-killing requirements in cities not meeting housing goals",
    "formalTitle": "An act to amend Sections 65400 and 65582.1 of, and to add and repeal Section 65913.4 of, the Government Code, relating to housing.",
    "summary": "This bill creates a streamlined, ministerial approval process for infill housing developments in localities not meeting their regional housing needs allocation (RHNA) goals, provided the development meets certain requirements. Eligible developments must comply with objective zoning standards, be on an infill site, pay prevailing wages, meet affordable housing requirements based on the locality's progress toward RHNA goals, and meet other criteria. The bill limits parking requirements and prohibits locals from applying additional requirements based on the streamlining. Approvals are valid for 3 years. The bill sunsets on January 1, 2026.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201720180SB35",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2017-09-29",
    "sponsors": [
      "Scott Wiener"
    ],
    "relatedBills": [
      "SB423"
    ],
    "tags": [
      "zoning reform",
      "affordable housing"
    ]
  },
  {
    "id": "SB423",
    "memTitle": "Streamline housing approval even more for cities not meeting housing goals",
    "formalTitle": "An act to amend Section 65913.4 of the Government Code, relating to land use.",
    "summary": "Expands and enhances SB 35 (2017) which created a streamlined, ministerial approval process for housing in localities not meeting their regional housing needs allocation (RHNA). Key changes include allowing approvals in more areas of the coastal zone, revising labor provisions, prohibiting locals from requiring certain studies/materials for streamlined projects, extending the law's sunset to 2036, and allowing state agencies to use the streamlining on state land. It also includes provisions for Native American tribal consultation and public meetings for certain projects prior to approval.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240SB423",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-11",
    "sponsors": [
      "Scott Wiener"
    ],
    "relatedBills": [
      "SB35"
    ],
    "tags": [
      "zoning reform",
      "affordable housing"
    ]
  },
  {
    "id": "AB2011",
    "memTitle": "Streamline approvals of new housing in commercial zones, with some strings attached",
    "formalTitle": "An act to amend Sections 65400 and 65585 of, and to add and repeal Chapter 4.1 (commencing with Section 65912.100) of Division 1 of Title 7 of, the Government Code, relating to housing.",
    "summary": "Creates two streamlined ministerial approval processes for housing in commercial zones: one for 100% affordable housing and one for mixed-income housing that meets specified affordability, labor, and environmental criteria. Key provisions include requiring housing in commercial zones to be a \"use by right\", relaxing parking requirements, requiring prevailing wages and health benefits, and mandating relocation assistance for displaced businesses. Also requires annual reporting on projects, studies by HCD on outcomes, and sunsets on January 1, 2033.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220AB2011",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-09-28",
    "sponsors": [
      "Buffy Wicks"
    ],
    "relatedBills": [
      "SB6"
    ],
    "tags": [
      "affordable housing",
      "reporting",
      "ministerial approval"
    ]
  },
  {
    "id": "SB6",
    "memTitle": "Bypass rezoning for housing in retail- and office-zoned areas",
    "formalTitle": "An act to amend Section 65913.4 of, and to add and repeal Section 65852.24 of, the Government Code, relating to land use.",
    "summary": "Deems a housing development project an allowable use on a parcel zoned for office, retail, or parking if it meets certain density requirements and other conditions. Requires such projects to comply with local zoning, parking, design and other ordinances. Limits project site to 20 acres or less in urban areas. Requires relocation assistance for displaced businesses. Allows local agencies to exempt parcels if residential density is reallocated. Does not alter housing, environmental, or labor laws applicable to the project. Sunsets the law on January 1, 2033.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB6",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-09-28",
    "sponsors": [
      "Anna Caballero"
    ],
    "relatedBills": [
      "AB2011"
    ],
    "tags": [
      "zoning reform"
    ]
  },
  {
    "id": "SB50",
    "memTitle": "Slash NIMBY constraints statewide & allow many more homes to be built",
    "formalTitle": "Planning and zoning: housing development: streamlined approval: incentives.",
    "summary": "Aimed to boost housing production by requiring local governments to grant incentives for housing developments that meet certain criteria, such as being located near jobs or transit. The bill would have amended the Housing Accountability Act to limit local control over housing development and streamline approval processes. It included provisions for sensitive communities and would have delayed implementation in potentially sensitive areas.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201920200SB50",
    "states": [
      "California"
    ],
    "statuses": [
      "Failed"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Scott Wiener"
    ],
    "major": true,
    "tags": [
      "zoning reform",
      "approval process",
      "transit oriented development"
    ]
  },
  {
    "id": "SB1211",
    "memTitle": "No parking space replacement mandates, and more multi-family flexibility, for ADU development",
    "formalTitle": "An act to amend Section 65852.2 of the Government Code relating to land use.",
    "summary": "Amend the Planning and Zoning Law concerning the development of Accessory Dwelling Units (ADUs), prohibit local agencies from requiring the replacement of parking spaces when a carport, covered parking structure, or uncovered parking space is demolished or converted into an ADU. The bill modifies existing provisions to allow for the ministerial approval of multiple ADUs on lots with existing or proposed multifamily dwellings. It specifies that detached or attached ADUs may be developed in amounts equal to one or 25% of the existing multifamily dwelling units, whichever is greater, and authorizes two detached ADUs on lots with existing or proposed multifamily dwellings, subject to height limitations and setback requirements. Additionally, the bill ensures that the construction or conversion of ADUs does not necessitate the replacement of demolished or converted parking spaces. By imposing new duties on local governments regarding ADU approvals, SB 1211 creates a state-mandated local program.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1211",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Nancy Skinner"
    ],
    "tags": [
      "ADU",
      "parking mandates",
      "whack-a-mole"
    ]
  },
  {
    "id": "SB1210",
    "memTitle": "Try to ease the pain of utility connection charges for new housing",
    "formalTitle": "An act to add Chapter 8 (commencing with Section 8395) to Division 4.1 of the Public Utilities Code, relating to utility service.",
    "summary": "Prohibits connection, capacity, or other point of connection charges from public utilities or special districts for electrical, gas, sewer, or water service for new housing construction from exceeding 1% of the reported building permit value of the housing unit. Requires these charges to be issued over a period of at least 10 years from when the housing unit is first occupied, with subsequent owners continuing payment if sold within that period. Mandates public utilities and special districts to prioritize new housing construction for electrical, gas, sewer, and water service connections over other structures. Additionally, requires public reporting on the internet of any charges issued by the housing unit’s address annually.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1210",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Nancy Skinner"
    ],
    "tags": [
      "utility connections"
    ]
  },
  {
    "id": "SB1470",
    "memTitle": "Start fixing our draconian construction defect legal regime",
    "formalTitle": "An act to amend Sections 895, 896, 897, 916, 921, 926, 927, 933, 934, and 945.5 of the Civil Code, relating to construction defects.",
    "summary": "Amends existing laws to modify the standards for determining liability in construction defect cases for residential units. It clarifies that a deficiency must materially affect habitability or usefulness, and result from failing to meet the industry's standard of care. The bill introduces a role for a special inspector in overseeing repair works and requires the builder to secure a building permit for such repairs. It also allows builders to obtain a release or waiver upon repair completion and mandates local authorities to issue building permits within 30 days. Moreover, it adds to the affirmative defenses available to builders in construction defect cases, including compliance with building permits and special inspector approval.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1470",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Steve Glazer"
    ],
    "tags": [
      "condo",
      "construction defect"
    ]
  },
  {
    "id": "SB1462",
    "memTitle": "Encourage condo construction by allowing escrow funds to be used for construction",
    "formalTitle": "An act to add Sections 11013.7 and 11013.8 to the Business and Professions Code, relating to subdivisions.",
    "summary": "Allows for the early disbursement of a purchaser's deposit held in escrow for lots or parcels within a subdivision to cover project construction costs, including various fees and expenses associated with the project's development. Specifies conditions under which these funds can be released prior to closing, including requirements for project budget submission, recording of the project's declaration and bylaws, and proof of sufficient funds to complete the project. Additionally, mandates the Department of Real Estate to complete reviews within 30 days regarding the disbursement of these funds and requires developers to prominently display notices in their public reports if purchaser's deposits will be disbursed before closing.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB1462",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Steve Glazer"
    ],
    "tags": [
      "escrow",
      "development finance"
    ]
  },
  {
    "id": "AB2144",
    "memTitle": "Comply with the fee transparency requirements we mandated in 2019",
    "formalTitle": "An act to amend Section 65400 of the Government Code, relating to housing.",
    "summary": "Amends the Government Code to require city or county planning agencies to include evidence of compliance with internet website requirements in their annual housing data report. These requirements pertain to maintaining current schedules of fees, exactions, affordability requirements, zoning ordinances, development standards, and annual fee reports on the city's or county's website, among other provisions. The amendment aims to ensure transparency and accessibility of housing-related information.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB2144",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Tim Grayson"
    ],
    "tags": [
      "fee transparency"
    ],
    "relatedBills": [
      "AB1483"
    ]
  },
  {
    "id": "AB1483",
    "memTitle": "Make the fees charged for new housing development visible and legible",
    "formalTitle": "An act to add Section 65940.1 to the Government Code and to amend Section 50452 of the Health and Safety Code, relating to housing.",
    "summary": "Mandates cities, counties, and special districts to maintain an up-to-date schedule of fees, exactions, and affordability requirements, among other housing development-related information, on their websites. Aims to enhance housing data collection and reporting, facilitating the availability and transparency of housing data to support enforcement of housing laws and inform state housing policymaking. Also requires the inclusion of a 10-year housing data strategy in revisions of the California Statewide Housing Plan, involving a comprehensive evaluation of data needs and strategies for achieving consistency in housing data terminology and reporting across the state.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=201920200AB1483",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2019-10-09",
    "sponsors": [
      "Tim Grayson"
    ],
    "tags": [
      "fee transparency"
    ],
    "relatedBills": [
      "AB2144"
    ]
  },
  {
    "id": "SB450",
    "memTitle": "Lot splits are allowed; stop killing them with NIMBY nonsense",
    "formalTitle": "An act to amend Sections 65585, 65852.21, and 66411.7 of the Government Code, relating to land use.",
    "summary": "Aims to reinforce SB 9 by removing local obstructions to housing development. Eliminates the restriction against demolishing more than 25% of existing exterior structural walls for ministerial approval of housing projects. Prohibits local agencies from imposing non-uniform objective zoning, subdivision, or design standards that effectively block SB 9 projects. Mandates a 60-day timeframe for local agencies to approve or deny SB 9 applications, with automatic approval thereafter. Provides the Department of Housing and Community Development (HCD) with oversight and enforcement authority to ensure compliance.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240SB450",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Toni Atkins"
    ],
    "tags": [
      "whack-a-mole",
      "lot split"
    ],
    "relatedBills": [
      "SB9"
    ]
  },
  {
    "id": "AB3057",
    "memTitle": "Junior ADUs should get the same CEQA exemption as ADUs",
    "formalTitle": "An act to amend Section 21080.17 of the Public Resources Code, relating to environmental quality.",
    "summary": "AB 3057 rectifies a legislative oversight by extending the existing California Environmental Quality Act (CEQA) exemption, which currently applies to standard Accessory Dwelling Unit (ADU) ordinances, to include Junior Accessory Dwelling Units (JADUs). This amendment facilitates local compliance with state housing laws by exempting JADU ordinances from CEQA review, mirroring the treatment for standard ADUs. The change aims to streamline the process for creating small, affordable rental units within the existing footprint of homes, supporting California's broader efforts to increase housing stock and affordability.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB3057",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Lori D. Wilson"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "AB2580",
    "memTitle": "Sneaky abuse of historic preservation to kill housing must at least be disclosed",
    "formalTitle": "An act to amend Sections 65400 and 65583 of the Government Code, relating to historical resources.",
    "summary": "Mandates cities and counties to consider housing needs when designating historic districts or buildings, requiring them to report these designations and their impacts on housing to the California Department of Housing and Community Development (HCD) as part of their Annual Progress Report for the Regional Housing Needs Assessment. Aims to ensure local governments harmonize historic preservation efforts with the urgency to address California’s housing shortage, promoting a more balanced approach to maintaining heritage while facilitating residential development.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB2580",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Buffy Wicks"
    ],
    "tags": [
      "historic preservation",
      "whack-a-mole"
    ]
  },
  {
    "id": "AB1820",
    "memTitle": "Mandatory upfront clarity on housing development fees",
    "formalTitle": "An act to amend Sections 65940.1 and 65941.1 of and to add Section 65943.1 to the Government Code relating to housing.",
    "summary": "Requires cities to provide an estimate of development fees at the time of building permit application, promoting fee transparency and predictability for housing projects. AB 1820 ensures that builders have a clear understanding of the financial requirements from the outset, aiming to reduce unexpected costs that can delay or jeopardize housing developments. The legislation mandates that an itemized list and total sum of all fees and exactions be provided within 10 days of a preliminary application, and again upon final approval of a housing development project. It addresses the issue of high and unpredictable impact fees by ensuring that developers are informed of their fee obligations early in the project planning process.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB1820",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Pilar Schiavo"
    ],
    "tags": [
      "fee transparency"
    ]
  },
  {
    "id": "HB1291",
    "memTitle": "Allow up to 2 ADUs by right and liberalize some rules",
    "formalTitle": "An act relative to accessory dwelling unit uses allowed by right.",
    "summary": "Amends the state's accessory dwelling unit (ADU) law to allow 2 ADUs by right on lots with single-family homes, up from the current 1 by right. Defines attached and detached ADUs. Allows municipalities to require additional ADUs beyond the first to be attached. Removes some restrictions on ADU placement, ingress/egress, parking requirements, aesthetic standards, and minimum sizes. Allows ADUs to count toward a municipality's workforce housing requirements if they meet certain criteria.",
    "legislativeTextURI": "https://www.gencourt.state.nh.us/bill_Status/billinfo.aspx?id=1221",
    "states": [
      "New Hampshire"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Ellen Read"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "HB1399",
    "memTitle": "Allow up to 2 homes in formerly single-family zones",
    "formalTitle": "An act allowing municipalities to permit 2 residential units in certain single-family residential zones.",
    "summary": "Allows single-family homes on lots of 2 acres or less in at least 50% of a municipality's single-family zones to expand to 2 units by right, without discretionary review, if certain conditions are met. These include being outside hazard areas, not demolishing more than 25% of walls (with exceptions), and not eliminating moderate/low-income restricted units. Municipalities can apply objective standards that don't preclude 2 1,250+ sqft units, require septic upgrades and parking, deny projects with specific adverse impacts, and require 30+ day rental terms. Temporary delays allowed for inadequate water/sewer.",
    "legislativeTextURI": "https://www.gencourt.state.nh.us/bill_Status/billinfo.aspx?id=1756",
    "states": [
      "New Hampshire"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": null,
    "sponsors": [
      "Rebecca McWilliams"
    ],
    "tags": [
      "duplex",
      "lot split"
    ]
  },
  {
    "id": "SB330",
    "memTitle": "Essentially outlaw downzoning for a decade and curtail some NIMBY delay tactics",
    "formalTitle": "An act to amend Section 65589.5 of, to amend, repeal, and add Sections 65940, 65943, and 65950 of, to add and repeal Sections 65905.5, 65913.10, and 65941.1 of, and to add and repeal Chapter 12 (commencing with Section 66300) of Division 1 of Title 7 of the Government Code, relating to housing.",
    "summary": "Aims to accelerate housing production across the state by imposing restrictions on local jurisdictions' ability to downzone or cap the number of housing permits. The Act prohibits local agencies from disapproving housing development projects that comply with current zoning rules unless specific findings are provided. It further aims to streamline the housing approval process by limiting the number of public hearings on projects and by suspending local practices that directly or indirectly inhibit the feasibility of housing projects compliant with existing zoning and planning standards. This Act is part of broader efforts to address California's housing shortage and affordability crisis by facilitating the development of more housing units, including low-, moderate-, and high-income housing.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201920200SB330",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2019-10-09",
    "sponsors": [
      "Nancy Skinner"
    ],
    "tags": [
      "zoning reform",
      "approval process"
    ]
  },
  {
    "id": "SB102",
    "memTitle": "The 'Live Local Act': funds affordable housing & preempts many local restrictions",
    "formalTitle": "An act relating to housing; providing a short title; amending various sections to enhance affordable housing provisions, remove rent controls, and implement tax exemptions for affordable housing.",
    "summary": "Aims to address affordable housing issues by removing the authority of local governments to impose rent controls, modifying requirements for land use plans, expediting the process for surplusing government lands for affordable housing, and introducing tax exemptions for lands used for affordable housing. Revises the state housing strategy and encourages the development of affordable housing through public infrastructure projects.",
    "legislativeTextURI": "https://www.flsenate.gov/Session/Bill/2023/102",
    "states": [
      "Florida"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-01",
    "sponsors": [
      "Alexis Calatayud"
    ],
    "tags": [
      "rent control",
      "affordable housing",
      "tax exemption",
      "zoning reform"
    ],
    "major": true
  },
  {
    "id": "S100",
    "memTitle": "Sweeping reforms to allow more housing density and diversity",
    "formalTitle": "Act Relating to Housing Opportunities Made for Everyone (HOME)",
    "summary": "Makes adjustments to municipal planning and zoning to favor higher density and diverse housing types like duplexes and multi-unit dwellings, particularly in areas served by municipal sewer and water services. Restricts excessive parking requirements, mandates acceptance of duplexes in single-family zones, eases the creation of accessory dwelling units (ADUs), and adjusts Act 250's jurisdictional threshold to facilitate more housing developments. Addresses deed restrictions, enhances compliance with energy standards, and establishes various committees and task forces to support ongoing housing development and improvement efforts.",
    "legislativeTextURI": "https://legislature.vermont.gov/bill/status/2024/S.100",
    "states": [
      "Vermont"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-06-05",
    "tags": [
      "zoning reform",
      "ADU",
      "parking mandates"
    ],
    "major": true
  },
  {
    "id": "HB14",
    "memTitle": "Streamline property development with third-party reviews",
    "formalTitle": "Relating to third-party review of plats and property development plans, permits, and similar documents, and the inspection of an improvement related to such a document.",
    "summary": "Introduces a new section, 250.014, to Chapter 250 of the Local Government Code, aimed at expediting the approval process for property development in Texas. It allows for third-party review of development documents and permits if regulatory approvals are delayed beyond 15 days. The act specifies the criteria for third-party reviewers and inspectors, prohibits additional fees for third-party services, outlines the requirements for review or inspection, and sets an appeals process for applicants. Aims to streamline property development by reducing bureaucratic delays.",
    "legislativeTextURI": "https://capitol.texas.gov/BillLookup/History.aspx?LegSess=88R&Bill=HB14",
    "states": [
      "Texas"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-09-01",
    "sponsors": [
      "Cody Harris",
      "Steve Toth"
    ],
    "tags": [
      "permitting"
    ]
  },
  {
    "id": "SB323",
    "memTitle": "Duplex housing must be allowed in cities of more than 5k people.",
    "formalTitle": "AN ACT GENERALLY REVISING MUNICIPAL ZONING LAWS; REQUIRING CERTAIN CITIES TO ALLOW THE USE OF DUPLEX HOUSING IN ZONING REGULATIONS",
    "summary": "Revises municipal zoning laws to mandate cities with populations of at least 5,000 to permit duplex housing in areas zoned for single-family residences. It defines duplex housing and family units, aiming to promote urban growth and housing diversity. The act amends sections 76-2-304 and 76-2-309 of the Montana Code Annotated (MCA), establishing guidelines for zoning regulations to meet public health, safety, and general welfare objectives. Effective from January 1, 2024.",
    "legislativeTextURI": "https://leg.mt.gov/bills/2023/billhtml/SB0323.htm",
    "states": [
      "Montana"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2024-01-01",
    "sponsors": [
      "Jeremy Trebas"
    ],
    "tags": [
      "zoning reform",
      "duplex"
    ]
  },
  {
    "id": "SB406",
    "memTitle": "Require local government building codes to be no more restrictive than state standard",
    "formalTitle": "AN ACT PROHIBITING A LOCAL GOVERNMENT FROM ADOPTING BUILDING CODES THAT ARE MORE STRINGENT THAN STATE BUILDING CODES",
    "summary": "SB0406 amends Section 50-60-301, MCA, preventing local governments in Montana from adopting building codes stricter than state-established ones, except for voluntary energy conservation standards exceeding state requirements if they provide local incentives.",
    "legislativeTextURI": "https://leg.mt.gov/bills/2023/billhtml/SB0406.htm",
    "states": [
      "Montana"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-01",
    "sponsors": [
      "Jeremy Trebas"
    ],
    "tags": [
      "building codes"
    ]
  },
  {
    "id": "SB382",
    "memTitle": "Comprehensively reform statewide land use policy",
    "formalTitle": "AN ACT CREATING THE MONTANA LAND USE PLANNING ACT",
    "summary": "Updates outdated zoning and planning statutes from the 1920s. Introduces a unified approach to planning, streamlines permitting processes, and mandates that local governments evaluate and meet housing needs. The bill emphasizes public participation in early planning stages and requires cities to adopt zoning reforms, making housing development faster, cheaper, and more predictable.",
    "legislativeTextURI": "https://leg.mt.gov/bills/2023/billhtml/SB0382.htm",
    "states": [
      "Montana"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-05-17",
    "sponsors": [
      "Forrest Mandeville"
    ],
    "tags": [
      "zoning reform",
      "permitting"
    ],
    "major": true
  },
  {
    "id": "HB2720",
    "memTitle": "Big cities must allow at least one ADU on single-family lots, and some poison pills are forbidden.",
    "formalTitle": "AN ACT AMENDING TITLE 9 CHAPTER 4 ARTICLE 6 ARIZONA REVISED STATUTES BY ADDING SECTION 9-461.18; RELATING TO MUNICIPAL PLANNING",
    "summary": "HB2720 mandates Arizona municipalities with populations over 75,000 to adopt regulations permitting accessory dwelling units (ADUs) on single-family zoned lots. The bill sets allowances and prohibitions for ADUs, such as a minimum of one ADU per lot, additional ADUs if they are restricted-affordable, and a maximum size limit. It prohibits restrictions like additional parking requirements, design conformity mandates, and more restrictive zoning. Failure to adopt regulations by January 1, 2025, allows unlimited ADUs.",
    "legislativeTextURI": "https://apps.azleg.gov/BillStatus/BillOverview/81315",
    "states": [
      "Arizona"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": "2025-01-01",
    "sponsors": [
      "Michael Carbone"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "HB166",
    "memTitle": "ADUs must not be bannable by HOA restrictions",
    "formalTitle": "AN ACT RELATING TO INTERNAL ACCESSORY DWELLING UNITS; AMENDING CHAPTER 32, TITLE 55, IDAHO CODE",
    "summary": "Amends Idaho Code to allow the creation of internal accessory dwelling units (ADUs) within homeowner's associations (HOAs) territories, defining permissible restrictions. Establishes that no covenants can outright prohibit internal ADUs within or attached to a primary residence or its garage, provided they are for housing relatives or tenants for periods longer than 30 days. Permits HOAs to impose reasonable regulations concerning these ADUs, such as size and parking requirements, while voiding any restrictive covenants against internal ADUs created after July 1, 2023.",
    "legislativeTextURI": "https://legislature.idaho.gov/sessioninfo/2023/legislation/h0166/",
    "states": [
      "Idaho"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-04-03",
    "tags": [
      "ADU",
      "HOA"
    ]
  },
  {
    "id": "LD1706",
    "memTitle": "Clarify details of statewide ADU standards, and more time to comply",
    "formalTitle": "An Act to Clarify Statewide Laws Regarding Affordable Housing and Accessory Dwelling Units",
    "summary": "Amends Maine's housing laws to extend the implementation dates for affordable housing development requirements and accessory dwelling unit (ADU) permissions across municipalities. It defines 'affordable housing development' with specific income thresholds for rental and owned housing affordability. The act sets new implementation dates: January 1, 2024, for municipalities with ordinance enactment by municipal officers, and July 1, 2024, for others. It mandates municipalities to permit up to two additional dwelling units on lots with existing homes, subject to certain conditions, and ensures long-term affordability of such housing developments through restrictive covenants for a minimum of 30 years. The legislation also specifies zoning and subdivision requirements for ADUs, aiming to facilitate the addition of such units statewide while adhering to local and environmental regulations.",
    "legislativeTextURI": "https://legislature.maine.gov/LawMakerWeb/summary.asp?ID=280088800",
    "states": [
      "Maine"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-06-16",
    "sponsors": [
      "Marc Malon"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "LD2003",
    "memTitle": "Set housing goals, impose some density requirements, and legalize ADUs",
    "formalTitle": "An Act To Implement the Recommendations of the Commission To Increase Housing Opportunities in Maine by Studying Zoning and Land Use Restrictions",
    "summary": "Enacts measures to increase housing opportunities across Maine by setting statewide and regional housing production goals, in collaboration with the Maine State Housing Authority. It mandates municipalities to permit higher density affordable housing developments, establishing a density minimum of 2.5 times the base density in multifamily dwelling zones, with specific off-street parking space caps. The act requires a 30-year minimum duration for affordable housing developments' restrictive covenants. Dictates municipalities to allow up to four dwelling units per lot in designated growth areas or where municipal services are available, aiming to streamline the approval process for such developments. Allows accessory dwelling units (ADUs) on single-family lots, sets minimum size requirements for ADUs, and mandates municipal compliance with water and wastewater service verification for housing units.",
    "legislativeTextURI": "https://legislature.maine.gov/LawMakerWeb/summary.asp?ID=280082953",
    "states": [
      "Maine"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-04-27",
    "sponsors": [
      "Ryan Fecteau"
    ],
    "tags": [
      "ADU",
      "zoning reform",
      "parking mandates",
      "housing goals"
    ],
    "major": true
  },
  {
    "id": "SB528",
    "memTitle": "At least one ADU must be allowed, and some poison pills are forbidden",
    "formalTitle": "AN ACT REVISING MUNICIPAL ZONING LAWS TO ALLOW FOR ACCESSORY DWELLING UNITS; REQUIRING MUNICIPALITIES TO ADOPT CERTAIN REGULATIONS IN RELATION TO ACCESSORY DWELLING UNITS; PROHIBITING CERTAIN REGULATIONS IN RELATION TO ACCESSORY DWELLING UNITS; ALLOWING A MUNICIPALITY TO CHARGE A FEE TO REVIEW APPLICATIONS TO CREATE ACCESSORY DWELLING UNITS; AND PROVIDING A DELAYED EFFECTIVE DATE.",
    "summary": "Revises municipal zoning laws in Montana to support the development of accessory dwelling units (ADUs) by requiring municipalities to permit at least one ADU per lot with a single-family dwelling. It limits ADU size to 75% of the primary residence's gross floor area or 1,000 square feet, whichever is less, and prohibits municipalities from imposing additional parking requirements, matching exterior designs, ownership occupancy requirements, impact fees, and more restrictive development standards than those for the primary dwelling. Municipalities may charge up to $250 for ADU application reviews but cannot enforce non-compliant regulations after January 1, 2024.",
    "legislativeTextURI": "http://leg.mt.gov/bills/2023/billpdf/SB0528.pdf",
    "states": [
      "Montana"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2024-01-01",
    "sponsors": [
      "Greg Hertz"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "EHB1337",
    "memTitle": "ADUs must be allowed, and various poison pills are prohibited",
    "formalTitle": "AN ACT Relating to expanding housing options by easing barriers to the construction and use of accessory dwelling units; amending RCW 36.70A.696, 43.21C.495, and 36.70A.280; adding new sections to chapter 36.70A RCW; adding a new section to chapter 64.34 RCW; adding a new section to chapter 64.32 RCW; adding a new section to chapter 64.38 RCW; adding a new section to chapter 64.90 RCW; creating a new section; and repealing RCW 35.63.210, 35A.63.230, 36.70A.400, 36.70.677, and 43.63A.215.",
    "summary": "Facilitates the construction and use of accessory dwelling units (ADUs) within urban growth areas. Mandates cities and counties to adopt or amend regulations to support ADU creation, limiting the imposition of certain restrictions, such as off-street parking requirements within half a mile of major transit stops and imposing maximum gross floor area restrictions of no less than 1,000 square feet for ADUs. Impact fees on ADUs cannot exceed 50% of those for the principal unit, and cities and counties cannot require ADU owners to occupy any unit on the property. This act also prohibits the sale or conveyance restrictions of ADUs as condominium units and exempts ADU-related actions from administrative or judicial appeals.",
    "legislativeTextURI": "https://app.leg.wa.gov/billsummary?BillNumber=1337&Initiative=false&Year=2023",
    "states": [
      "Washington"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-07-23",
    "sponsors": [
      "Mia Gregerson"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "E2SHB1110",
    "memTitle": "Missing middle housing must be allowed in cities",
    "formalTitle": "AN ACT Relating to creating more homes for Washington by increasing middle housing in areas traditionally dedicated to single-family detached housing; amending RCW 36.70A.030, 36.70A.280, 43.21C.495, and 43.21C.450; adding new sections to chapter 36.70A RCW; adding a new section to chapter 64.34 RCW; adding a new section to chapter 64.32 RCW; adding a new section to chapter 64.38 RCW; adding a new section to chapter 64.90 RCW; and creating new sections.",
    "summary": "Mandates cities engaged in Growth Management Act (GMA) planning to authorize increased densities for middle housing, defined as housing types like duplexes, triplexes, fourplexes, townhouses, and more, within residential zones. Cities with populations over 25,000 are required to allow at least two to six units per lot, depending on city size and proximity to major transit stops, with additional requirements for affordable housing units.",
    "legislativeTextURI": "https://app.leg.wa.gov/billsummary?BillNumber=1110&Initiative=false&Year=2023",
    "states": [
      "Washington"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-07-23",
    "sponsors": [
      "Jessica Bateman"
    ],
    "tags": [
      "zoning reform",
      "missing middle"
    ],
    "major": true
  },
  {
    "id": "SB9",
    "memTitle": "Urban lot splits must be allowed; up to 4 homes where there was just one",
    "formalTitle": "AN ACT to address California's housing crisis by legalizing the construction of middle-income housing and small multi-family housing developments near jobs and transit",
    "summary": "Mandates ministerial approval for housing developments of no more than 2 units within single-family zones, subject to specific conditions, including prohibitions on demolishing rent-restricted housing, and historic sites. Authorizes local agencies to impose objective standards that do not physically preclude construction of up to 2 units or reduce unit size below 800 square feet. Enables urban lot splits if meeting similar conditions. Exempts these approvals from CEQA. Requires affidavits for owner occupancy of urban lot splits, barring community land trusts or qualified nonprofits.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB9",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-01-01",
    "sponsors": [
      "Toni Atkins"
    ],
    "tags": [
      "missing middle",
      "lot split"
    ]
  },
  {
    "id": "SB827",
    "memTitle": "Taller buildings must be allowed near transit",
    "formalTitle": "PLANNING AND ZONING: TRANSIT-RICH HOUSING BONUS",
    "summary": "Requires local governments to grant a transit-rich housing bonus for developments near major transit stops or high-quality transit corridors, meeting certain planning standards. This includes adhering to local inclusionary housing ordinances or providing onsite affordable housing, preparing relocation benefits for displaced persons, and complying with zoning and design controls. Developers receiving the bonus must offer monthly transit passes to residents at no cost and adhere to specific height, density, and parking regulations.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billStatusClient.xhtml?bill_id=201720180SB827",
    "states": [
      "California"
    ],
    "statuses": [
      "Failed"
    ],
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "zoning reform",
      "transit oriented development"
    ],
    "major": true
  },
  {
    "id": "SB50",
    "memTitle": "Legalize many more homes near jobs and transit with default zoning",
    "formalTitle": "PLANNING AND ZONING: HOUSING DEVELOPMENT: STREAMLINED APPROVAL: INCENTIVES",
    "summary": "Authorizes streamlined, ministerial approval for neighborhood multifamily projects on eligible parcels without conditional use permits. Defines eligible projects and parcels, limits local parking requirements, and sets automatic expiration of approval in 3 years with possible one-year extension. Exempts projects from CEQA. Requires cities, counties, or both to grant an equitable communities incentive for developments meeting specific criteria, including being a job-rich or transit-rich housing project, with additional requirements for developments in counties based on population size. Implements delays for sensitive communities, with certain exemptions for local flexibility plans approved by the Department of Housing and Community Development.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=201920200SB50",
    "states": [
      "California"
    ],
    "statuses": [
      "Failed"
    ],
    "inEffectDate": "",
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "zoning reform",
      "transit oriented development",
      "affordable housing"
    ],
    "major": true
  },
  {
    "id": "AB1033",
    "memTitle": "Allow ADUs and main homes to be sold separately as condos",
    "formalTitle": "AN ACT TO AMEND SECTIONS 65852.2 AND 65852.26 OF THE GOVERNMENT CODE, RELATING TO HOUSING",
    "summary": "Authorizes but does not require local agencies to permit the separate sale or conveyance of primary dwelling units and accessory dwelling units (ADUs) as condominiums under specified conditions. Introduces conforming changes to facilitate this process and imposes new duties on local governments regarding ADU approvals.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB1033",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-11",
    "sponsors": [
      "Phil Ting"
    ],
    "tags": [
      "ADU"
    ],
    "relatedBills": [
      "AB976"
    ]
  },
  {
    "id": "AB976",
    "memTitle": "End mandatory owner-occupancy for ADUs",
    "formalTitle": "AN ACT TO AMEND SECTION 65852.2 OF THE GOVERNMENT CODE, RELATING TO LAND USE",
    "summary": "Prohibits local agencies from imposing an owner-occupancy requirement on any accessory dwelling unit (ADU). Allows for rental terms of 30 days or longer. Makes additional amendments to ADU regulations to align with AB 1033, provided AB 1033 and this bill are both enacted and this bill is enacted last.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202320240AB976",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-10-11",
    "sponsors": [
      "Phil Ting"
    ],
    "tags": [
      "ADU",
      "owner occupancy"
    ],
    "relatedBills": [
      "AB1033"
    ]
  },
  {
    "id": "AB2221",
    "memTitle": "Expand ADU flexibility and streamline approvals",
    "formalTitle": "AN ACT TO REPEAL AND AMEND SECTION 65852.2 OF THE GOVERNMENT CODE, RELATING TO LAND USE",
    "summary": "Modifies regulations to allow detached accessory dwelling units (ADUs) to include a garage, sets clear approval or denial timelines for ADU applications, and restricts local agencies from imposing certain zoning and lot standards that prevent the construction of at least an 800 square foot ADU. Also prohibits local agencies from denying permits for unpermitted ADUs constructed prior to January 1, 2018, under specified conditions.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202120220AB2221",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-09-28",
    "sponsors": [
      "Sharon Quirk-Silva"
    ],
    "tags": [
      "ADU",
      "whack-a-mole"
    ]
  },
  {
    "id": "SB897",
    "memTitle": "Eliminate various ADU poison pills, raise height limits, refine junior ADU provisions",
    "formalTitle": "AN ACT TO AMEND SECTION 65852.22 OF, TO ADD SECTION 65852.23 TO, AND TO REPEAL AND AMEND SECTION 65852.2 OF, THE GOVERNMENT CODE, AND TO AMEND SECTION 17980.12 OF THE HEALTH AND SAFETY CODE, RELATING TO LAND USE",
    "summary": "Increases the height limits for ADUs near transit or in multi-story buildings to 18 feet, and to 25 feet for attached ADUs. Introduces objective standards for ADU development, prohibits denying ADU permits due to nonconforming conditions not affecting health and safety, and requires simultaneous permit processing for ADUs and primary residences. Allows junior ADUs within single-family residences with various stipulations, including separate entrances and efficiency kitchens.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billNavClient.xhtml?bill_id=202120220SB897",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2022-09-28",
    "sponsors": [
      "Bob Wieckowski"
    ],
    "tags": [
      "ADU",
      "whack-a-mole",
      "objective standards",
      "permitting"
    ]
  },
  {
    "id": "AB68",
    "memTitle": "Streamline approvals for 'climate-smart' housing developments",
    "formalTitle": "AN ACT TO AMEND SECTION 65585 OF, TO ADD SECTIONS 65040.18, 65914.7.5, AND 66425.5 TO, AND TO ADD CHAPTER 4.3.1 (COMMENCING WITH SECTION 65918.5) TO DIVISION 1 OF TITLE 7 OF, THE GOVERNMENT CODE, RELATING TO LAND USE",
    "summary": "Mandates streamlined, ministerial approval for housing developments meeting certain criteria, including climate-smart parcel location or inclusion in a region's sustainable communities strategy. Specifies conditions under which local governments cannot increase density or approve subdivisions and utility extensions on climate-resilient lands, barring compliance with specific planning requirements. Introduces obligations for local governments concerning housing element approval, public hearing notices, and finding requirements confirmed by the Office of Planning and Research.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240AB68",
    "states": [
      "California"
    ],
    "statuses": [
      "Failed"
    ],
    "sponsors": [
      "Christopher Ward"
    ],
    "tags": [
      "zoning reform",
      "sprawl control"
    ]
  },
  {
    "id": "AB881",
    "memTitle": "Expand options for creating ADUs",
    "formalTitle": "AN ACT TO AMEND, REPEAL, AND ADD SECTION 65852.2 OF THE GOVERNMENT CODE, RELATING TO HOUSING",
    "summary": "Revamps regulations for accessory dwelling units (ADUs) by eliminating local standards on lot coverage and minimum lot size, reducing parking and setback requirements, and shortening the approval timeline. Prohibits owner-occupancy requirements until 2025. Establishes a minimum allowable ADU size, promoting the creation of these units to address housing shortages.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billVotesClient.xhtml?bill_id=201920200AB881",
    "states": [
      "California"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2019-10-09",
    "sponsors": [
      "Richard Bloom"
    ],
    "tags": [
      "ADU"
    ]
  },
  {
    "id": "SB1037",
    "memTitle": "Tighten the reins on local housing plan compliance",
    "formalTitle": "AN ACT TO AMEND SECTION 65400 OF AND TO ADD SECTION 65009.1 TO THE GOVERNMENT CODE, RELATING TO HOUSING",
    "summary": "Imposes civil penalties on cities, counties, or local agencies failing to comply with state housing law, including ministerial approval of housing projects and adoption of housing element revisions. Penalties range from $10,000 to $50,000 per month per violation. Funds collected go to the Building Homes and Jobs Trust Fund, earmarked for affordable housing development within the offending jurisdiction. Authorizes fund redirection to statewide affordable housing if not used within five years.",
    "legislativeTextURI": "https://leginfo.legislature.ca.gov/faces/billTextClient.xhtml?bill_id=202320240SB1037",
    "states": [
      "California"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": "",
    "sponsors": [
      "Scott Wiener"
    ],
    "tags": [
      "enforcement"
    ]
  },
  {
    "id": "HB368",
    "memTitle": "Study whether some buildings should be allowed to have just one exit",
    "formalTitle": "An Act to direct the Board of Housing and Community Development to convene a stakeholder advisory group to evaluate and recommend revisions to the Uniform Statewide Building Code to permit Group R-2 occupancies to be served by a single exit.",
    "summary": "Directs the Board of Housing and Community Development to convene a stakeholder advisory group, including fire code officials, to recommend revisions to the Uniform Statewide Building Code allowing Group R-2 occupancies up to six stories to have a single exit. The group must submit findings by December 1, 2024.",
    "legislativeTextURI": "https://lis.virginia.gov/cgi-bin/legp604.exe?241+sum+HB368",
    "states": [
      "Virginia"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2024-07-01",
    "sponsors": [
      "Adele Y. McClure"
    ],
    "tags": [
      "building codes","single stair"
    ]
  },
  {
    "id": "HB24-1239",
    "memTitle": "Let multifamily buildings go taller with just one exit",
    "formalTitle": "Concerning requiring a local government to modify a building code to allow five stories of a multifamily residential building to be served by a single exit.",
    "summary": "Requires, by December 1, 2026, local governments to adopt or amend building codes to allow a single exit for up to five stories of a multifamily residential building. Specifies incorporation of language from any American jurisdiction's building code allowing such a single exit for Group R-2 occupancy. Provides for technical assistance by the Department of Local Affairs upon request.",
    "legislativeTextURI": "http://leg.colorado.gov/bills/hb24-1239",
    "states": [
      "Colorado"
    ],
    "statuses": [
      "Pending"
    ],
    "inEffectDate": "2024-08-07",
    "sponsors": [
      "Alex Valdez",
      "Kevin Priola"
    ],
    "tags": [
      "building codes","single stair"
    ]
  },
  {
    "id": "S1052",
    "memTitle": "Boost housing near transit through a pilot program",
    "formalTitle": "AN ACT RELATING TO TOWNS AND CITIES -- ZONING ORDINANCES",
    "summary": "Establishes a transit-oriented development pilot program to increase residential housing availability near public transportation, aiming to alleviate traffic congestion and support the Act on Climate goals. Effective from January 1, 2024, it allows municipalities with developable land near regional mobility hubs or frequent transit stops to apply for development funds, with specific criteria and application processes set by the Department of Housing in coordination with transportation and planning divisions.",
    "legislativeTextURI": "https://legiscan.com/RI/text/S1052/id/2827614/Rhode_Island-2023-S1052-Comm_Sub.pdf",
    "states": [
      "Rhode Island"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2024-01-01",
    "sponsors": [
      "Meghan E. Kallman"
    ],
    "tags": [
      "transit oriented development",
      "zoning reform"
    ]
  },
  {
    "id": "SB245",
    "memTitle": "Allow mixed-use and multiple-unit dwellings and limit parking mandates",
    "formalTitle": "AN ACT REVISING MUNICIPAL ZONING LAWS; REQUIRING CERTAIN MUNICIPALITIES TO ALLOW MULTIPLE-UNIT DWELLINGS AND MIXED-USE DEVELOPMENT; PROVIDING DEFINITIONS; AMENDING SECTIONS 76-2-304 AND 76-2-309 MCA; AND PROVIDING AN IMMEDIATE EFFECTIVE DATE AND A RETROACTIVE APPLICABILITY DATE.",
    "summary": "Mandates municipalities with populations over 5,000 to permit mixed-use and multiple-unit dwellings in commercial zones, given the availability of municipal water and sewer services. Limits off-street parking requirements to one space per dwelling unit.",
    "legislativeTextURI": "https://leg.mt.gov/bills/2023/billhtml/SB0245.htm",
    "states": [
      "Montana"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2023-05-18",
    "sponsors": [
      "Daniel Zolnikov"
    ],
    "tags": [
      "mixed use", "zoning reform","parking mandates"
    ]
  },
  {
    "id": "S1032",
    "memTitle": "Ease discretionary development processes",
    "formalTitle": "An act relating to towns and cities -- Zoning Ordinances",
    "summary": "Simplifies the process for obtaining development permissions, especially for properties that don't meet current zoning standards. Distinguishes between minor and significant variances, streamlining approvals for minor changes without board intervention unless contested by neighbors. Mandates that municipalities define clear, objective criteria for special use permits, ensuring uses not explicitly covered are permitted by default.",
    "legislativeTextURI": "https://webserver.rilegislature.gov/BillText23/SenateText23/S1032A.pdf",
    "states": [
      "Rhode Island"
    ],
    "statuses": [
      "Enacted"
    ],
    "inEffectDate": "2024-01-01",
    "sponsors": [
      "Frank Lombardi",
      "Matthew LaMountain",
      "Mark McKenney",
      "Linda Ujifusa",
      "Samuel Zurier",
      "Dawn Euer"
    ],
    "tags": [
      "zoning reform",
      "ADU"
    ]
  }
]